Table of Contents
 Class BeamLoadsImportMappingData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
BeamLoadsImportMappingData
[Serializable]
public class BeamLoadsImportMappingData
Inheritance
object
BeamLoadsImportMappingData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 BeamLoadsImportMappingData()
Constructor
public BeamLoadsImportMappingData()
Properties
 BeamID
BeamID
[DataMember]
public int BeamID { get; set; }
Property Value
int
 CADBeamID
CADBeamID
[DataMember]
public int CADBeamID { get; set; }
Property Value
int
 CoeffVM_X
CoeffVM_X
[DataMember]
public double CoeffVM_X { get; set; }
Property Value
double
 CoeffVM_Y
CoeffVM_Y
[DataMember]
public double CoeffVM_Y { get; set; }
Property Value
double
 CoeffVM_Z
CoeffVM_Z
[DataMember]
public double CoeffVM_Z { get; set; }
Property Value
double
 Edit this page